app/Controllers/OrgCrud.php

    public function index(){
        // $OrgModel = model("OrgModel");
        $data['users'] = $this->OrgModel->orderBy('org_id', 'DESC')->findAll();
---
SELECT *
FROM "org"
ORDER BY "org_id" DESC

    public function singleUser($id = null){
        $OrgModel = model("OrgModel");
        $data['user_obj'] = $this->OrgModel->where('org_id', $id)->first();
---
SELECT *
FROM "org"
WHERE "org_id" = '12'
 LIMIT 1

    public function update(){
        // $OrgModel = model("OrgModel");
        $id = $this->request->getVar('org_id');
        $data = $this->request->getVar(array("org_name", "org_plan", "org_lines"));
        // $data = array("data" => $data);


        $this->OrgModel->update($id, $data);
---
UPDATE "org" SET "org_name" = 'Organization 9', "org_plan" = 'Plan I', "org_lines" = '91'
WHERE "org"."org_id" IN ('9')